It indicates whether the energy model is based on rooms/spaces or building elements.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public EnergyModelType EnergyModelType { get; set; }
  Visual Basic
Public Property EnergyModelType As EnergyModelType
	Get
	Set
  Visual C++
public:
property EnergyModelType EnergyModelType {
	EnergyModelType get ();
	void set (EnergyModelType value);
}
 Remarks
 The default value is EnergyModelType::SpatialElement.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   When setting this property: A value passed for an enumeration argument is not a member of that enumeration
 See Also
  EnergyAnalysisDetailModelOptions Class
  Autodesk.Revit.DB.Analysis Namespace